% 运动学正解推算
% @Time:2021/7/29 17:30
% @Auther:Tonghui Wang
% @File:fkine.m
% @software:MATLAB

% 正解函数
% 输入：各关节位移
%	   旋转轴位移值单位为°,移动轴位移值单位为mm
% 输出：TCP位姿描述(XYZABC)
%	   XYZ输出值单位为mm,ABC输出值单位为°
function [p]=fkine(q)

q(3)=-q(3);
q(4)=-q(4);

s4=sind(q(4));
c4=cosd(q(4));
s5=sind(q(5));
c5=cosd(q(5));

%% 20230613
% DH参数
% a5=100;
% d5=100;
% d6=100;

% T=eye(4);
% T(1,1)=c4*c5;
% T(1,2)=s4;
% T(1,3)=c4*s5;
% T(1,4)=q(1)+a5*c4+d5*s4+d6*c4*s5;
% T(2,1)=s4*c5;
% T(2,2)=-c4;
% T(2,3)=s4*s5;
% T(2,4)=q(2)+a5*s4-d5*c4+d6*s4*s5;
% T(3,1)=s5;
% T(3,2)=0;
% T(3,3)=-c5;
% T(3,4)=q(3)-d6*c5;

%% 20230615
% DH参数
a6=0;
d6=20;

T=eye(4);
T(1,1)=c4;
T(1,2)=-s4*s5;
T(1,3)=-s4*c5;
T(1,4)=q(1)-d6*s4*c5-a6*s4*s5;
T(2,1)=0;
T(2,2)=-c5;
T(2,3)=s5;
T(2,4)=q(2)+d6*s5-a6*c5;
T(3,1)=-s4;
T(3,2)=-c4*s5;
T(3,3)=-c4*c5;
T(3,4)=q(3)-d6*c4*c5-a6*c4*s5;

p=[T(1:3,4)',rad2deg(tform2eul(T,'ZYX'))];
end
